; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	thermograph2 - mode
	thermograph1 - mode
	image0 - mode
	GroundStation5 - direction
	Star8 - direction
	GroundStation4 - direction
	Star2 - direction
	GroundStation3 - direction
	GroundStation7 - direction
	Star6 - direction
	Star1 - direction
	Star0 - direction
	Star9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Planet14 - direction
	Planet15 - direction
	Planet16 - direction
	Phenomenon17 - direction
)
(:init
	(supports instrument0 thermograph1)
	(calibration_target instrument0 Star6)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 thermograph2)
	(supports instrument1 thermograph1)
	(supports instrument1 image0)
	(calibration_target instrument1 Star2)
	(calibration_target instrument1 GroundStation7)
	(calibration_target instrument1 Star6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet14)
	(supports instrument2 image0)
	(supports instrument2 thermograph2)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 Star0)
	(supports instrument3 thermograph2)
	(supports instrument3 image0)
	(calibration_target instrument3 GroundStation3)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 Star6)
	(calibration_target instrument4 GroundStation7)
	(calibration_target instrument4 Star1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star6)
	(supports instrument5 thermograph2)
	(supports instrument5 thermograph1)
	(calibration_target instrument5 Star0)
	(calibration_target instrument5 Star1)
	(calibration_target instrument5 Star6)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star8)
)
(:goal (and
	(pointing satellite1 Star1)
	(pointing satellite2 Star6)
	(have_image Star9 image0)
	(have_image Star10 thermograph1)
	(have_image Phenomenon11 thermograph2)
	(have_image Phenomenon12 image0)
	(have_image Planet13 thermograph2)
	(have_image Planet14 thermograph2)
	(have_image Planet15 thermograph2)
	(have_image Planet16 thermograph1)
	(have_image Phenomenon17 thermograph2)
))

)

; plan
1. (turn_to satellite1 star1 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star1)
   goals met: 1 of 11
2. (turn_to satellite0 groundstation7 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 groundstation7)
   goals met: 1 of 11
3. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 11
4. (calibrate satellite0 instrument1 groundstation7)
   added: (calibrated instrument1)
   goals met: 1 of 11
5. (turn_to satellite0 planet13 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 planet13)
   goals met: 1 of 11
6. (take_image satellite0 planet13 instrument1 thermograph2)
   added: (have_image planet13 thermograph2)
   goals met: 2 of 11
7. (turn_to satellite0 phenomenon17 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 phenomenon17)
   goals met: 2 of 11
8. (take_image satellite0 phenomenon17 instrument1 thermograph2)
   added: (have_image phenomenon17 thermograph2)
   goals met: 3 of 11
9. (turn_to satellite0 phenomenon12 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 phenomenon12)
   goals met: 3 of 11
10. (take_image satellite0 phenomenon12 instrument1 image0)
   added: (have_image phenomenon12 image0)
   goals met: 4 of 11
11. (turn_to satellite0 phenomenon11 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon11)
   goals met: 4 of 11
12. (take_image satellite0 phenomenon11 instrument1 thermograph2)
   added: (have_image phenomenon11 thermograph2)
   goals met: 5 of 11
13. (turn_to satellite0 planet14 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 planet14)
   goals met: 5 of 11
14. (take_image satellite0 planet14 instrument1 thermograph2)
   added: (have_image planet14 thermograph2)
   goals met: 6 of 11
15. (turn_to satellite0 planet15 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet15)
   goals met: 6 of 11
16. (take_image satellite0 planet15 instrument1 thermograph2)
   added: (have_image planet15 thermograph2)
   goals met: 7 of 11
17. (turn_to satellite0 planet16 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 planet16)
   goals met: 7 of 11
18. (take_image satellite0 planet16 instrument1 thermograph1)
   added: (have_image planet16 thermograph1)
   goals met: 8 of 11
19. (turn_to satellite0 star10 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 star10)
   goals met: 8 of 11
20. (take_image satellite0 star10 instrument1 thermograph1)
   added: (have_image star10 thermograph1)
   goals met: 9 of 11
21. (turn_to satellite0 star9 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star9)
   goals met: 9 of 11
22. (take_image satellite0 star9 instrument1 image0)
   added: (have_image star9 image0)
   goals met: 10 of 11
23. (turn_to satellite2 star6 star8)
   deleted: (pointing satellite2 star8)
   added: (pointing satellite2 star6)
   goals met: 11 of 11
